package com.karandashov.repository;

/**
 * Предположим, что это очень важный ВНЕШНИЙ ресурс, с котором нужно работать строго в однопоточном режиме.
 * В локальном случае мы могли бы повесить synchronized, но в нашем случае мы не можем, так как это внешний ресурс
 * (например какая-нибудь специфическая база данных).
 * У нас вполне может быть несколько сервисов, которые работают с этим ресурсом и пытаеются паралельно выполнять inc().
 * Самый базовый пример: представьте, что несколько сервисов отвечают за обработку игрового поля, которое лежит вот в этом ресурсе.
 * То есть локальные блокировки не помогут, они не действуют на другие сервисы. Нужны блокировки между сервисами - распределенные блокировки.
 */
public class ImportantRepository {

    private static Integer counter = 0;

    public void inc() {
        counter++;
    }

    public Integer get() {
       return counter;
    }

    public void reset() {
        counter = 0;
    }
}
